Revit 2026 API

# PointLocationOnCurveMeasurementType Property

---

The measurement type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PointOnCurveMeasurementType MeasurementType { get; set; }
```
```vb
Public Property MeasurementType As PointOnCurveMeasurementType
	Get
	Set
```
```cpp
public:
property PointOnCurveMeasurementType MeasurementType {
	PointOnCurveMeasurementType get ();
	void set (PointOnCurveMeasurementType value);
}
```
```fsharp
member MeasurementType : PointOnCurveMeasurementType with get, set
```

#### Property Value

PointOnCurveMeasurementType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The measurement type is not checked until this class is assigned for a particular reference point on a particular curve. At that time, the measurement type must be valid for the curve.

#### Reference

PointLocationOnCurve Class

Autodesk.Revit.DB Namespace